{
  "title": "A scholarly research portal on leadership cults, totalitarian governance, and primary-source based history",
  "intro": "This project is designed as a **citation-grade reference desk**. It indexes primary sources (with provenance) and maps them to reputable scholarship.\n\n**Core principles**\n- **Non-glorifying**: no admiration framing, no propaganda reproduction as spectacle.\n- **Evidence-led**: each page links to sources and scholarly treatments.\n- **Transparent uncertainty**: where evidence is incomplete, that is stated clearly.\n\nUse the hub pages below as entry points, or search across document cards and explainers.",
  "hubs": [
    {
      "slug": "governance",
      "name": "Governance & Führerprinzip",
      "blurb": "Institutions, power flows, and administrative reality (structure over myth).",
      "overview": "Focus: the *Führerprinzip* as an organising idea and how governance operated in practice (formal and informal power)."
    },
    {
      "slug": "command",
      "name": "Decision-making & Chain of Command",
      "blurb": "How decisions moved through civil/military channels; coordination and conflict.",
      "overview": "Focus: decision cycles, competing jurisdictions, and how directives were communicated and implemented."
    },
    {
      "slug": "security",
      "name": "Security State",
      "blurb": "Police, SS, courts, prisons — organisational roles and functions.",
      "overview": "Focus: security institutions, legal instruments, and enforcement mechanisms, treated analytically."
    },
    {
      "slug": "economy",
      "name": "War Economy & Administration",
      "blurb": "Ministries, production, labour systems, and administrative coordination.",
      "overview": "Focus: war economy structures and administrative machinery, with document trails."
    },
    {
      "slug": "propaganda",
      "name": "Propaganda System",
      "blurb": "Institutions, techniques, campaigns — how persuasion and control operated.",
      "overview": "Focus: propaganda institutions and methods, studied as communications systems."
    },
    {
      "slug": "foreign-policy",
      "name": "Foreign Policy & War Aims",
      "blurb": "Decision points, inflection moments, and strategic framing.",
      "overview": "Focus: key moments in foreign policy decision-making and their documentary footprint."
    },
    {
      "slug": "sources",
      "name": "Primary Sources Index",
      "blurb": "How to locate, evaluate, and cite primary sources; provenance notes.",
      "overview": "Focus: archive pathways, citation formats, authenticity checks, and document card standards."
    },
    {
      "slug": "historiography",
      "name": "Historiography & Methods",
      "blurb": "How historians know what they know; dispute mapping and standards.",
      "overview": "Focus: methods, evidentiary standards, and how scholarly disagreements are structured."
    }
  ]
}